OpenFOAM-v1712/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

# create mesh
runApplication blockMesh

# create ignition cells cellSet
runApplication topoSet

runApplication $(getApplication)

#------------------------------------------------------------------------------
